# RebarHookLengthOverride Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarHookLengthOverride Property
ParameterTypeId Class See Also
---
"Override Hook Lengths"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarHookLengthOverride { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarHookLengthOverride As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarHookLengthOverride {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace